## JupyterLab Bağlantı Ayarları

In [1]:
# %%!
# pip install --trusted-host pypi.org ipython-sql

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///sql-datasets.db

### SELECT (seçme)

In [3]:
# tüm tabloları gösterme,

In [4]:
%%sql
SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///sql-datasets.db
Done.

[('Employees',),
 ('OrderDetails',),
 ('Shippers',),
 ('Suppliers',),
 ('Orders',),
 ('Products',),
 ('Categories',),
 ('Customers',),
 ('yeni_tablo',)]

In [145]:
%%sql
DROP TABLE yeni_tablo;

 * sqlite:///sql-datasets.db
Done.

[]

In [5]:
%%sql
SELECT * FROM Customers LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [8]:
# DISTINCT, essiz degerleri bulmak icin kullanılır

In [21]:
%%sql
SELECT COUNT(DISTINCT Country) AS toplamUlke FROM Customers;

 * sqlite:///sql-datasets.db
Done.

[(21,)]

In [25]:
# columns,

In [22]:
%%sql
SELECT * FROM Customers WHERE 1 = 0;

 * sqlite:///sql-datasets.db
Done.

[]

In [27]:
%%sql
SELECT CustomerName, City, Country FROM Customers LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[('Alfreds Futterkiste', 'Berlin', 'Germany'),
 ('Ana Trujillo Emparedados y helados', 'México D.F.', 'Mexico'),
 ('Antonio Moreno Taquería', 'México D.F.', 'Mexico'),
 ('Around the Horn', 'London', 'UK'),
 ('Berglunds snabbköp', 'Luleå', 'Sweden')]

In [28]:
%%sql
SELECT * FROM Products LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21)]

### WHERE (filtreleme)

In [35]:
%%sql
SELECT * FROM Customers LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [37]:
%%sql
SELECT * FROM Customers WHERE City = 'México D.F.';

 * sqlite:///sql-datasets.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico'),
 (58, 'Pericles Comidas clásicas', 'Guillermo Fernández', 'Calle Dr. Jorge Cash 321', 'México D.F.', '5033', 'Mexico'),
 (80, 'Tortuga Restaurante', 'Miguel Angel Paolino', 'Avda. Azteca 123', 'México D.F.', '5033', 'Mexico')]

In [43]:
%%sql
SELECT * FROM Customers
WHERE CustomerID = 22;

 * sqlite:///sql-datasets.db
Done.

[(22, 'FISSA Fabrica Inter. Salchichas S.A.', 'Diego Roel', 'C/ Moralzarzal, 86', 'Madrid', '28034', 'Spain')]

WHERE ile kullanılan operatörler,
* =, <, >, <=, >=, BETWEEN, LIKE, IN

In [47]:
%%sql
SELECT * FROM Customers
WHERE CustomerID BETWEEN 16 AND 22;

 * sqlite:///sql-datasets.db
Done.

[(16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK'),
 (17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', '52066', 'Germany'),
 (18, 'Du monde entier', 'Janine Labrune', '67, rue des Cinquante Otages', 'Nantes', '44000', 'France'),
 (19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK'),
 (20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', '8010', 'Austria'),
 (21, 'Familia Arquibaldo', 'Aria Cruz', 'Rua Orós, 92', 'São Paulo', '05442-030', 'Brazil'),
 (22, 'FISSA Fabrica Inter. Salchichas S.A.', 'Diego Roel', 'C/ Moralzarzal, 86', 'Madrid', '28034', 'Spain')]

In [93]:
%%sql
SELECT * FROM Products WHERE (Price BETWEEN 10 AND 20) AND NOT CategoryID IN (1,2,3)

 * sqlite:///sql-datasets.db
Done.

[(36, 'Inlagd Sill', 17, 8, '24 - 250 g jars', 19),
 (42, 'Singaporean Hokkien Fried Mee', 20, 5, '32 - 1 kg pkgs.', 14),
 (46, 'Spegesild', 21, 8, '4 - 450 g glasses', 12),
 (54, 'Tourtière', 25, 6, '16 pies', 16),
 (58, 'Escargots de Bourgogne', 27, 8, '24 pieces', 13),
 (73, 'Röd Kaviar', 17, 8, '24 - 150 g jars', 15),
 (74, 'Longlife Tofu', 4, 7, '5 kg pkg.', 10)]

In [52]:
%%sql
SELECT * FROM Customers
WHERE Country LIKE '%il';

 * sqlite:///sql-datasets.db
Done.

[(15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (21, 'Familia Arquibaldo', 'Aria Cruz', 'Rua Orós, 92', 'São Paulo', '05442-030', 'Brazil'),
 (31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil'),
 (34, 'Hanari Carnes', 'Mario Pontes', 'Rua do Paço, 67', 'Rio de Janeiro', '05454-876', 'Brazil'),
 (61, 'Que Delícia', 'Bernardo Batista', 'Rua da Panificadora, 12', 'Rio de Janeiro', '02389-673', 'Brazil'),
 (62, 'Queen Cozinha', 'Lúcia Carvalho', 'Alameda dos Canàrios, 891', 'São Paulo', '05487-020', 'Brazil'),
 (67, 'Ricardo Adocicados', 'Janete Limeira', 'Av. Copacabana, 267', 'Rio de Janeiro', '02389-890', 'Brazil'),
 (81, 'Tradição Hipermercados', 'Anabela Domingues', 'Av. Inês de Castro, 414', 'São Paulo', '05634-030', 'Brazil'),
 (88, 'Wellington Importadora', 'Paula Parente', 'Rua do Mercado, 12', 'Resende', '08737-363', 'Brazil')]

In [55]:
%%sql
SELECT * FROM Customers
WHERE City IN ('Resende', 'London');

 * sqlite:///sql-datasets.db
Done.

[(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK'),
 (16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK'),
 (19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK'),
 (53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK'),
 (72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK'),
 (88, 'Wellington Importadora', 'Paula Parente', 'Rua do Mercado, 12', 'Resende', '08737-363', 'Brazil')]

In [91]:
%%sql
SELECT * FROM Customers WHERE CustomerID IN (1,3,5,7);

 * sqlite:///sql-datasets.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')]

### AND, OR, NOT

In [65]:
%%sql
SELECT * FROM Customers
WHERE Country = 'UK' OR City = 'São Paulo';

 * sqlite:///sql-datasets.db
Done.

[(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK'),
 (15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK'),
 (19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK'),
 (21, 'Familia Arquibaldo', 'Aria Cruz', 'Rua Orós, 92', 'São Paulo', '05442-030', 'Brazil'),
 (38, 'Island Trading', 'Helen Bennett', 'Garden House Crowther Way', 'Cowes', 'PO31 7PJ', 'UK'),
 (53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK'),
 (62, 'Queen Cozinha', 'Lúcia Carvalho', 'Alameda dos Canàrios, 891', 'São Paulo', '05487-020', 'Brazil'),
 (72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK'),
 (81, 'Tradição Hipermercados', 'Anabela Domingues', 'Av. Inês de Castro, 414', 'São Paulo', '05634-030', 'Brazil')]

In [76]:
%%sql
SELECT * FROM Customers
WHERE NOT Country = 'USA' LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [78]:
%%sql
SELECT * FROM Customers
WHERE NOT Country = 'Germany' AND NOT Country = 'USA'
LIMIT 10;

 * sqlite:///sql-datasets.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France'),
 (8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain'),
 (9, "Bon app'", 'Laurence Lebihans', '12, rue des Bouchers', 'Marseille', '13008', 'France'),
 (10, 'Bottom-Dollar Marketse', 'Elizabeth Lincoln', '23 Tsawassen Blvd.', 'Tsawassen', 'T2F 8M4', 'Canada'),
 (11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK'),
 (12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', '1010', 'Argentina')]

In [92]:
%%sql
SELECT * FROM Customers WHERE Country = 'USA' AND City IN ('Eugene', 'Elgin');

 * sqlite:///sql-datasets.db
Done.

[(32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA')]

### ORDER BY (sıralama)

In [79]:
# order by ile kullanılan operatörler ASC ve DESC

In [81]:
%%sql
SELECT * FROM Customers LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [86]:
%%sql
SELECT * FROM Customers
ORDER BY Country LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[(12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', '1010', 'Argentina'),
 (54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', '1010', 'Argentina'),
 (64, 'Rancho grande', 'Sergio Gutiérrez', 'Av. del Libertador 900', 'Buenos Aires', '1010', 'Argentina'),
 (20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', '8010', 'Austria'),
 (59, 'Piccolo und mehr', 'Georg Pipps', 'Geislweg 14', 'Salzburg', '5020', 'Austria')]

In [88]:
%%sql
SELECT * FROM Customers
ORDER BY CustomerName, Country LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')]

In [90]:
%%sql
SELECT * FROM Customers
ORDER BY Country ASC, CustomerName DESC LIMIT 10;

 * sqlite:///sql-datasets.db
Done.

[(64, 'Rancho grande', 'Sergio Gutiérrez', 'Av. del Libertador 900', 'Buenos Aires', '1010', 'Argentina'),
 (54, 'Océano Atlántico Ltda.', 'Yvonne Moncada', 'Ing. Gustavo Moncada 8585 Piso 20-A', 'Buenos Aires', '1010', 'Argentina'),
 (12, 'Cactus Comidas para llevar', 'Patricio Simpson', 'Cerrito 333', 'Buenos Aires', '1010', 'Argentina'),
 (59, 'Piccolo und mehr', 'Georg Pipps', 'Geislweg 14', 'Salzburg', '5020', 'Austria'),
 (20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', '8010', 'Austria'),
 (76, 'Suprêmes délices', 'Pascale Cartrain', 'Boulevard Tirou, 255', 'Charleroi', 'B-6000', 'Belgium'),
 (50, 'Maison Dewey', 'Catherine Dewey', 'Rue Joseph-Bens 532', 'Bruxelles', 'B-1180', 'Belgium'),
 (88, 'Wellington Importadora', 'Paula Parente', 'Rua do Mercado, 12', 'Resende', '08737-363', 'Brazil'),
 (81, 'Tradição Hipermercados', 'Anabela Domingues', 'Av. Inês de Castro, 414', 'São Paulo', '05634-030', 'Brazil'),
 (67, 'Ricardo Adocicados', 'Janete Limeira', 'Av. Copacabana, 267', 'Rio de Janeiro', '02389-890', 'Brazil')]

### NULL

In [95]:
%%sql
SELECT * FROM Customers 
WHERE CustomerID IS NULL;

 * sqlite:///sql-datasets.db
Done.

[]

In [98]:
%%sql
SELECT CustomerName, ContactName
FROM Customers
WHERE Address IS NOT NULL
LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[('Alfreds Futterkiste', 'Maria Anders'),
 ('Ana Trujillo Emparedados y helados', 'Ana Trujillo'),
 ('Antonio Moreno Taquería', 'Antonio Moreno'),
 ('Around the Horn', 'Thomas Hardy'),
 ('Berglunds snabbköp', 'Christina Berglund')]

### DELETE

In [101]:
%%sql
SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///sql-datasets.db
Done.

[('Employees',),
 ('OrderDetails',),
 ('Shippers',),
 ('Suppliers',),
 ('Orders',),
 ('Products',),
 ('Categories',),
 ('Customers',),
 ('yeni_tablo',)]

In [102]:
%%sql
DELETE FROM yeni_tablo;

 * sqlite:///sql-datasets.db
3 rows affected.

[]

In [103]:
%%sql
SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///sql-datasets.db
Done.

[('Employees',),
 ('OrderDetails',),
 ('Shippers',),
 ('Suppliers',),
 ('Orders',),
 ('Products',),
 ('Categories',),
 ('Customers',),
 ('yeni_tablo',)]

### MIN, MAX, COUNT, AVG, SUM

In [5]:
%%sql
SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///sql-datasets.db
Done.

[('Employees',),
 ('OrderDetails',),
 ('Shippers',),
 ('Suppliers',),
 ('Orders',),
 ('Products',),
 ('Categories',),
 ('Customers',),
 ('yeni_tablo',)]

In [6]:
%%sql
SELECT * FROM Products LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21)]

In [8]:
%%sql
SELECT MIN(Price) AS minPrice FROM Products;

 * sqlite:///sql-datasets.db
Done.

[(6,)]

In [11]:
%%sql
SELECT COUNT(*) FROM Products;

 * sqlite:///sql-datasets.db
Done.

[(77,)]

In [13]:
%%sql
SELECT SUM(Price) AS sumPrice FROM Products;

 * sqlite:///sql-datasets.db
Done.

[(3015,)]

In [18]:
%%sql
SELECT COUNT(*) FROM Products
WHERE Price = 22;

 * sqlite:///sql-datasets.db
Done.

[(1,)]

In [19]:
%%sql
SELECT COUNT(*) FROM Customers
WHERE Country = 'Mexico';

 * sqlite:///sql-datasets.db
Done.

[(5,)]

In [21]:
%%sql
SELECT COUNT(Price) AS count, 
MIN(Price) AS min, 
MAX(Price) AS max, 
AVG(Price) AS avg, 
SUM(Price) AS sum FROM Products;

 * sqlite:///sql-datasets.db
Done.

[(77, 6, 435, 39.15584415584416, 3015)]

### LIKE (arama)

LIKE ile arama operatorleri
* 'a%' : “a” ile başlayan değerler
* '%a' : “a” ile biten değerler
* %or%' : herhangi bir yerinde “or” olan değerler
* '_r%' : ikinci sirasında “r” olan değerler
* 'a%%' : “a” ile başlayıp en az 3 karakterden oluşan değerler
* 'a%o' : “a” ile başlayıp “o” ile biten değerler

In [24]:
%%sql
SELECT * FROM Products
WHERE ProductName
LIKE 'b%';

 * sqlite:///sql-datasets.db
Done.

[(40, 'Boston Crab Meat', 19, 8, '24 - 4 oz tins', 43)]

In [29]:
%%sql
SELECT * FROM Customers
WHERE CustomerName
LIKE '%ers%'

 * sqlite:///sql-datasets.db
Done.

[(25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', '80805', 'Germany'),
 (37, 'Hungry Owl All-Night Grocers', 'Patricia McKenna', '8 Johnstown Road', 'Cork', None, 'Ireland'),
 (82, "Trail's Head Gourmet Provisioners", 'Helvetius Nagy', '722 DaVinci Blvd.', 'Kirkland', '98034', 'USA')]

In [33]:
%%sql
SELECT * FROM Customers
WHERE CustomerName
LIKE '_r%'

 * sqlite:///sql-datasets.db
Done.

[(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', '52066', 'Germany'),
 (20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', '8010', 'Austria'),
 (25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', '80805', 'Germany'),
 (26, 'France restauration', 'Carine Schmitt', '54, rue Royale', 'Nantes', '44000', 'France'),
 (27, 'Franchi S.p.A.', 'Paolo Accorti', 'Via Monte Bianco 34', 'Torino', '10100', 'Italy'),
 (32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (33, 'GROSELLA-Restaurante', 'Manuel Pereira', '5ª Ave. Los Palos Grandes', 'Caracas', '1081', 'Venezuela'),
 (60, 'Princesa Isabel Vinhoss', 'Isabel de Castro', 'Estrada da saúde n. 58', 'Lisboa', '1756', 'Portugal'),
 (81, 'Tradição Hipermercados', 'Anabela Domingues', 'Av. Inês de Castro, 414', 'São Paulo', '05634-030', 'Brazil'),
 (82, "Trail's Head Gourmet Provisioners", 'Helvetius Nagy', '722 DaVinci Blvd.', 'Kirkland', '98034', 'USA')]

In [35]:
# wildcard seklinde arama

In [37]:
%%sql
SELECT * FROM Customers
WHERE City
LIKE 'b_r_in';

 * sqlite:///sql-datasets.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')]

### IN

In [54]:
%%sql
SELECT * FROM Customers
WHERE Country IN ('UK', 'USA') LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK'),
 (16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK'),
 (19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK'),
 (32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA')]

In [57]:
%%sql
SELECT * FROM Customers
WHERE City IN ('Berlin', 'Eugene')

 * sqlite:///sql-datasets.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA')]

### BETWEEN

In [61]:
%%sql
SELECT * FROM Products
WHERE ProductName BETWEEN "Carnarvon Tigers" AND "Chef Anton's Cajun Seasoning"
ORDER BY ProductName;

 * sqlite:///sql-datasets.db
Done.

[(18, 'Carnarvon Tigers', 7, 8, '16 kg pkg.', 62),
 (1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (39, 'Chartreuse verte', 18, 1, '750 cc per bottle', 18),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22)]

In [62]:
%%sql
SELECT * FROM Products
WHERE Price BETWEEN 10 AND 20
AND CategoryID NOT IN (1,2,3);

 * sqlite:///sql-datasets.db
Done.

[(36, 'Inlagd Sill', 17, 8, '24 - 250 g jars', 19),
 (42, 'Singaporean Hokkien Fried Mee', 20, 5, '32 - 1 kg pkgs.', 14),
 (46, 'Spegesild', 21, 8, '4 - 450 g glasses', 12),
 (54, 'Tourtière', 25, 6, '16 pies', 16),
 (58, 'Escargots de Bourgogne', 27, 8, '24 pieces', 13),
 (73, 'Röd Kaviar', 17, 8, '24 - 150 g jars', 15),
 (74, 'Longlife Tofu', 4, 7, '5 kg pkg.', 10)]

### ALIAS (isimledirme)

In [66]:
%%sql
SELECT CustomerName AS name,
CustomerID AS id FROM Customers
LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[('Alfreds Futterkiste', 1),
 ('Ana Trujillo Emparedados y helados', 2),
 ('Antonio Moreno Taquería', 3),
 ('Around the Horn', 4),
 ('Berglunds snabbköp', 5)]

In [67]:
%%sql
SELECT * FROM Customers LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [75]:
%%sql
SELECT CustomerName, (Address || ', ' || PostalCode || ' ' || City || ', ' || Country) AS Address
FROM Customers LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[('Alfreds Futterkiste', 'Obere Str. 57, 12209 Berlin, Germany'),
 ('Ana Trujillo Emparedados y helados', 'Avda. de la Constitución 2222, 5021 México D.F., Mexico'),
 ('Antonio Moreno Taquería', 'Mataderos 2312, 5023 México D.F., Mexico'),
 ('Around the Horn', '120 Hanover Sq., WA1 1DP London, UK'),
 ('Berglunds snabbköp', 'Berguvsvägen 8, S-958 22 Luleå, Sweden')]

In [76]:
%%sql
SELECT * FROM Orders LIMIT 5;

 * sqlite:///sql-datasets.db
Done.

[(10248, 90, 5, '4.07.1996', 3),
 (10249, 81, 6, '5.07.1996', 1),
 (10250, 34, 4, '8.07.1996', 2),
 (10251, 84, 3, '8.07.1996', 1),
 (10252, 76, 4, '9.07.1996', 2)]

In [80]:
%%sql
SELECT Orders.OrderID, Orders.OrderDate, Customers.CustomerName
FROM Customers, Orders
WHERE Customers.CustomerName = 'Around the Horn' AND Customers.CustomerID = Orders.CustomerID;

 * sqlite:///sql-datasets.db
Done.

[(10355, '15.11.1996', 'Around the Horn'),
 (10383, '16.12.1996', 'Around the Horn')]

In [81]:
# kısa yol,

In [83]:
%%sql
SELECT o.OrderID, o.OrderDate, c.CustomerName
FROM Customers AS c, Orders AS o
WHERE c.CustomerName = 'Around the Horn' AND c.CustomerID = o.CustomerID;

 * sqlite:///sql-datasets.db
Done.

[(10355, '15.11.1996', 'Around the Horn'),
 (10383, '16.12.1996', 'Around the Horn')]

### GROUP BY

In [84]:
%%sql
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country;

 * sqlite:///sql-datasets.db
Done.

[(3, 'Argentina'),
 (2, 'Austria'),
 (2, 'Belgium'),
 (9, 'Brazil'),
 (3, 'Canada'),
 (2, 'Denmark'),
 (2, 'Finland'),
 (11, 'France'),
 (11, 'Germany'),
 (1, 'Ireland'),
 (3, 'Italy'),
 (5, 'Mexico'),
 (1, 'Norway'),
 (1, 'Poland'),
 (2, 'Portugal'),
 (5, 'Spain'),
 (2, 'Sweden'),
 (2, 'Switzerland'),
 (7, 'UK'),
 (13, 'USA'),
 (4, 'Venezuela')]

In [87]:
%%sql
SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country
ORDER BY COUNT(CustomerID) DESC;

 * sqlite:///sql-datasets.db
Done.

[(13, 'USA'),
 (11, 'Germany'),
 (11, 'France'),
 (9, 'Brazil'),
 (7, 'UK'),
 (5, 'Spain'),
 (5, 'Mexico'),
 (4, 'Venezuela'),
 (3, 'Italy'),
 (3, 'Canada'),
 (3, 'Argentina'),
 (2, 'Switzerland'),
 (2, 'Sweden'),
 (2, 'Portugal'),
 (2, 'Finland'),
 (2, 'Denmark'),
 (2, 'Belgium'),
 (2, 'Austria'),
 (1, 'Poland'),
 (1, 'Norway'),
 (1, 'Ireland')]

In [91]:
%%sql
SELECT CategoryID, AVG(Price) AS mean
FROM Products
GROUP BY CategoryID;

 * sqlite:///sql-datasets.db
Done.

[(1, 42.75),
 (2, 28.25),
 (3, 33.76923076923077),
 (4, 74.9),
 (5, 23.571428571428573),
 (6, 55.166666666666664),
 (7, 32.2),
 (8, 26.5)]

### JOIN (birleştirme)

* inner join: tablolar arasında eşleşen değerlere sahip kayıtları seçer.

In [147]:
%%sql
SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///sql-datasets.db
Done.

[('Employees',),
 ('OrderDetails',),
 ('Shippers',),
 ('Suppliers',),
 ('Orders',),
 ('Products',),
 ('Categories',),
 ('Customers',)]

In [10]:
%%sql
SELECT * FROM Orders WHERE 1 = 0;

 * sqlite:///sql-datasets.db
Done.

[]

In [11]:
%%sql
SELECT * FROM Customers WHERE 1 = 0;

 * sqlite:///sql-datasets.db
Done.

[]

* Ortak olan sütun: 'CustomerID'

In [119]:
%%sql
SELECT o.OrderID, o.OrderDate, c.ContactName, c.City
FROM Orders AS o
INNER JOIN Customers AS c ON o.CustomerID = c.CustomerID LIMIT 7;

 * sqlite:///sql-datasets.db
Done.

[(10248, '4.07.1996', 'Matti Karttunen', 'Helsinki'),
 (10249, '5.07.1996', 'Anabela Domingues', 'São Paulo'),
 (10250, '8.07.1996', 'Mario Pontes', 'Rio de Janeiro'),
 (10251, '8.07.1996', 'Mary Saveley', 'Lyon'),
 (10252, '9.07.1996', 'Pascale Cartrain', 'Charleroi'),
 (10253, '10.07.1996', 'Mario Pontes', 'Rio de Janeiro'),
 (10254, '11.07.1996', 'Yang Wang', 'Bern')]

In [120]:
%%sql
SELECT o.OrderID, c.CustomerName, c.Address || ' ' || c.City || ', ' || c.Country AS AddressNew
FROM Orders AS o
INNER JOIN Customers AS c ON o.CustomerID = c.CustomerID LIMIT 10;

 * sqlite:///sql-datasets.db
Done.

[(10248, 'Wilman Kala', 'Keskuskatu 45 Helsinki, Finland'),
 (10249, 'Tradição Hipermercados', 'Av. Inês de Castro, 414 São Paulo, Brazil'),
 (10250, 'Hanari Carnes', 'Rua do Paço, 67 Rio de Janeiro, Brazil'),
 (10251, 'Victuailles en stock', '2, rue du Commerce Lyon, France'),
 (10252, 'Suprêmes délices', 'Boulevard Tirou, 255 Charleroi, Belgium'),
 (10253, 'Hanari Carnes', 'Rua do Paço, 67 Rio de Janeiro, Brazil'),
 (10254, 'Chop-suey Chinese', 'Hauptstr. 29 Bern, Switzerland'),
 (10255, 'Richter Supermarkt', 'Grenzacherweg 237 Genève, Switzerland'),
 (10256, 'Wellington Importadora', 'Rua do Mercado, 12 Resende, Brazil'),
 (10257, 'HILARIÓN-Abastos', 'Carrera 22 con Ave. Carlos Soublette #8-35 San Cristóbal, Venezuela')]

In [123]:
%%sql
SELECT o.OrderID, o.OrderDate, c.CustomerName, c.Address || ', ' || c.City || ', ' || c.PostalCode || c.Country AS Address, o.ShipperID
FROM Orders AS o
INNER JOIN Customers AS c ON o.CustomerID = c.CustomerID
ORDER BY o.OrderDate DESC
LIMIT 10;

 * sqlite:///sql-datasets.db
Done.

[(10376, '9.12.1996', 'Mère Paillarde', '43 rue St. Laurent, Montréal, H1J 1C3Canada', 2),
 (10377, '9.12.1996', 'Seven Seas Imports', '90 Wadhurst Rd., London, OX15 4NBUK', 3),
 (10325, '9.10.1996', 'Königlich Essen', 'Maubelstr. 90, Brandenburg, 14776Germany', 3),
 (10300, '9.09.1996', 'Magazzini Alimentari Riuniti', 'Via Ludovico il Moro 22, Bergamo, 24100Italy', 2),
 (10301, '9.09.1996', 'Die Wandernde Kuh', 'Adenauerallee 900, Stuttgart, 70563Germany', 2),
 (10277, '9.08.1996', 'Morgenstern Gesundkost', 'Heerstr. 22, Leipzig, 4179Germany', 3),
 (10252, '9.07.1996', 'Suprêmes délices', 'Boulevard Tirou, 255, Charleroi, B-6000Belgium', 2),
 (10409, '9.01.1997', 'Océano Atlántico Ltda.', 'Ing. Gustavo Moncada 8585 Piso 20-A, Buenos Aires, 1010Argentina', 1),
 (10349, '8.11.1996', 'Split Rail Beer & Ale', 'P.O. Box 555, Lander, 82520USA', 1),
 (10324, '8.10.1996', 'Save-a-lot Markets', '187 Suffolk Ln., Boise, 83720USA', 1)]

In [124]:
%%sql
SELECT COUNT(DISTINCT CustomerName) AS musteri_sayisi FROM
(SELECT o.OrderDate, c.CustomerName, c.Address || ', ' || c.City || ', ' || c.PostalCode || c.Country AS Address, o.ShipperID
FROM Orders AS o
INNER JOIN Customers AS c ON o.CustomerID = c.CustomerID
ORDER BY o.OrderDate DESC)

 * sqlite:///sql-datasets.db
Done.

[(74,)]

In [125]:
%%sql
SELECT COUNT(DISTINCT OrderID) AS order_sayisi FROM
(SELECT o.OrderID, o.OrderDate, c.CustomerName, c.Address || ', ' || c.City || ', ' || c.PostalCode || c.Country AS Address, o.ShipperID
FROM Orders AS o
INNER JOIN Customers AS c ON o.CustomerID = c.CustomerID
ORDER BY o.OrderDate DESC)

 * sqlite:///sql-datasets.db
Done.

[(196,)]

* left join: iki tabloya bağlı olarak, tüm veriler soldaki tablodan döndürülür. Soldaki tabloda bir kaydın bulunduğu, ancak sağdaki tabloda bulunmadığı değerler(NULL olarak) ve sağdaki tabloyla eşleşen değerler döndürülür. Left Join ve Left Outer Join aynıdır.

In [132]:
%%sql
SELECT c.CustomerName, o.OrderID, c.CustomerName
FROM Customers AS c
LEFT JOIN Orders AS o ON c.CustomerID = o.CustomerID
ORDER BY c.CustomerName
LIMIT 10;

 * sqlite:///sql-datasets.db
Done.

[('Alfreds Futterkiste', None, 'Alfreds Futterkiste'),
 ('Ana Trujillo Emparedados y helados', 10308, 'Ana Trujillo Emparedados y helados'),
 ('Antonio Moreno Taquería', 10365, 'Antonio Moreno Taquería'),
 ('Around the Horn', 10355, 'Around the Horn'),
 ('Around the Horn', 10383, 'Around the Horn'),
 ("B's Beverages", 10289, "B's Beverages"),
 ('Berglunds snabbköp', 10278, 'Berglunds snabbköp'),
 ('Berglunds snabbköp', 10280, 'Berglunds snabbköp'),
 ('Berglunds snabbköp', 10384, 'Berglunds snabbköp'),
 ('Blauer See Delikatessen', None, 'Blauer See Delikatessen')]

* right join: left joinin tam tersi

In [134]:
%%sql
SELECT * FROM Employees LIMIT 3;

 * sqlite:///sql-datasets.db
Done.

[(1, 'Davolio', 'Nancy', '8.12.1968', 'EmpID1.pic', "Education includes a BA in psychology from Colorado State University. She also completed (The Art of the Cold Call). Nancy is a member of 'Toastmasters International'."),
 (2, 'Fuller', 'Andrew', '19.02.1952', 'EmpID2.pic', 'Andrew received his BTS commercial and a Ph.D. in international marketing from the University of Dallas. He is fluent in French and Italian and reads ... (113 characters truncated) ... resident of sales. Andrew is a member of the Sales Management Roundtable, the Seattle Chamber of Commerce, and the Pacific Rim Importers Association.'),
 (3, 'Leverling', 'Janet', '30.08.1963', 'EmpID3.pic', 'Janet has a BS degree in chemistry from Boston College). She has also completed a certificate program in food retailing management. Janet was hired as a sales associate and was promoted to sales representative.')]

In [135]:
%%sql
SELECT * FROM Orders LIMIT 3;

 * sqlite:///sql-datasets.db
Done.

[(10248, 90, 5, '4.07.1996', 3),
 (10249, 81, 6, '5.07.1996', 1),
 (10250, 34, 4, '8.07.1996', 2)]

In [137]:
# ortak olan sütun: 'EmployeeID'

In [138]:
%%sql
SELECT e.LastName, e.Photo, o.OrderDate
FROM Employees AS e
RIGHT JOIN Orders AS o ON e.EmployeeID = o.EmployeeID LIMIT 10;

 * sqlite:///sql-datasets.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT e.LastName, e.Photo, o.OrderDate
FROM Employees AS e
RIGHT JOIN Orders AS o ON e.EmployeeID = o.EmployeeID LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [140]:
### RIGHT and FULL OUTER JOINs are not currently supported !! kaldırılmış !!